
# Класс клетки
# Элементы:
#
# Moved
# По умолчанию имеет значени false
# Показатель того, была ли уже эта
# клетка обработана алгоритмом
# См. Алгоритм Ли
#
# Distance
# По умолчанию имеет значение 1000
# В ходе ввыполнения алгоритма будет заменятся
# на наикрайчашуюю длину пути от точка старта
# См. Алгоритм Ли
#
# ClassRoom
# Динамическая переменная
# В ней содержится номер аудитории к которой принадлежит данная клетка
#
# NCR - Neighboring Class Room
# Это массив объектов Cell c которыми граничит данная клетка
#
# start, finish
# Это массивы сотоящиий из 2 элементов int
# Координаты краев клетки на карте
class Cell:
    Moved = False
    Distance = 1000
    def __init__(self,ClassRoom,NCR,start,finish ):
        self.ClassRoom = ClassRoom
        self.NCR = NCR
        self.start = start
        self.finish = finish





